# Hierarchical Indexing(MultiIndex) with Groupby

In [1]:
import pandas as pd

In [2]:
tit = pd.read_csv('../Course_Materials_Part2/Video_Lecture_NBs/titanic.csv', usecols=['survived', 'pclass', 'sex', 'age', 'fare'])

In [3]:
tit

     survived  pclass     sex   age     fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [6]:
summary = tit.groupby(['sex', 'pclass']).mean()

In [7]:
summary

               survived        age        fare
sex    pclass
female 1       0.968085  34.611765  106.125798
       2       0.921053  28.722973   21.970121
       3       0.500000  21.750000   16.118810
male   1       0.368852  41.281386   67.226127
       2       0.157407  30.740707   19.741782
       3       0.135447  26.507589   12.661633

In [8]:
summary.index

MultiIndex([('female', 1),
            ('female', 2),
            ('female', 3),
            (  'male', 1),
            (  'male', 2),
            (  'male', 3)],
           names=['sex', 'pclass'])

In [9]:
summary.loc[('female', 2), :]

survived     0.921053
age         28.722973
fare        21.970121
Name: (female, 2), dtype: float64

In [11]:
summary.loc[('female', 2), 'age']

28.722972972972972

In [12]:
summary.swaplevel().sort_index()

               survived        age        fare
pclass sex
1      female  0.968085  34.611765  106.125798
       male    0.368852  41.281386   67.226127
2      female  0.921053  28.722973   21.970121
       male    0.157407  30.740707   19.741782
3      female  0.500000  21.750000   16.118810
       male    0.135447  26.507589   12.661633

In [13]:
summary.reset_index()

      sex  pclass  survived        age        fare
0  female       1  0.968085  34.611765  106.125798
1  female       2  0.921053  28.722973   21.970121
2  female       3  0.500000  21.750000   16.118810
3    male       1  0.368852  41.281386   67.226127
4    male       2  0.157407  30.740707   19.741782
5    male       3  0.135447  26.507589   12.661633